const img1 = require("../images/slider/slide_1.png")
const img2 = require("../images/slider/slide_2.png")
const img3 = require("../images/slider/slide_3.png")


const sliderData = [
    {
        title: "Высококачественная женская рубашка-поло Pima.",
        description: "Невозможно не упомянуть линию тканей пима. Хлопок PIMA относится к сегменту премиальных материалов. Эта ткань отличается особо мягкой и нежной фактурой, повышенной плотностью и устойчивостью к механическим воздействиям. ",
        img: img1,
        color: "blue",
        path: "/catalog/tshirt-dinosaur-01"
    },
    {
        title: "Женская рубашка-поло из модала",
        description: "Женская рубашка поло из модала использует высококачественную экологически чистую технологию производства исключительно безусадочной ткани. Женская рубашка поло из модала - это подходящий продукт для тех, у кого такая динамичная рабочая среда.",
        img: img2,
        path: "/catalog/tshirt-dinosaur-02",
        color: "pink"
    },
    {
        title: "Женская футболка-поло Coolmax Lacoste",
        description: "Женская рубашка-поло изготовлена ​​из материала Coolmax, придающего ощущение прохлады при ношении. Эта рубашка поло Coolmax имеет чрезвычайно удобную посадку. Создание аккуратного дизайна обещает стать чрезвычайно популярной моделью рубашки поло в ближайшем будущем.",
        img: img3,
        path: "/catalog/tshirt-dinosaur-03",
        color: "orange"
    }
]

export default sliderData